[
  {
    "workout_id": "1",
    "workout_name": "STRONG AND STEADY",
    "workout_description": "This is a chest workout",
    "workout_level": "Beginner",
    "workout_weeks": [
      {
        "week_id": "1",
        "week_name": "Week 1",
        "week_description": "This is week 1",
        "exercises": [
          {
            "exercise_name": "Bench Press",
            "exercise_description": "A compound exercise that primarily targets the chest muscles, while also engaging the shoulders and triceps. It is performed by pressing a barbell or dumbbells away from the chest while lying on a bench."
          },
          {
            "exercise_name": "Pushups",
            "exercise_description": "A bodyweight exercise that targets the chest, shoulders, and triceps, performed by lowering and raising the body using the arms while maintaining a plank position."
          },
          {
            "exercise_name": "Chest Fly",
            "exercise_description": "An isolation exercise targeting the chest muscles, performed by lying on a bench and extending the arms out to the sides with dumbbells, then bringing them together in a hugging motion."
          }
        ]
      },
      {
        "week_id": "2",
        "week_name": "Week 2",
        "week_description": "This is week 2",
        "exercises": [
          {
            "exercise_name": "Incline Bench Press",
            "exercise_description": "A variation of the bench press performed on an incline bench, targeting the upper chest muscles and shoulders for improved strength and muscle definition."
          },
          {
            "exercise_name": "Dumbbell Fly",
            "exercise_description": "An isolation exercise targeting the chest muscles, performed by lying on a bench and extending the arms out to the sides with dumbbells, then bringing them together in a hugging motion."
          },
          {
            "exercise_name": "Chest Press",
            "exercise_description": "A fundamental exercise that targets the chest muscles, helping to build strength and muscle mass in the pectoral region."
          }
        ]
      },
      {
        "week_id": "3",
        "week_name": "Week 3",
        "week_description": "This is week 3",
        "exercises": [
          {
            "exercise_name": "Decline Bench Press",
            "exercise_description": "A variation of the bench press that targets the lower part of the chest muscles by performing the exercise on a decline bench."
          },
          {
            "exercise_name": "Chest Press",
            "exercise_description": "A fundamental exercise that targets the chest muscles, helping to build strength and muscle mass in the pectoral region."
          },
          {
            "exercise_name": "Chest Fly",
            "exercise_description": "An isolation exercise that targets the chest muscles, performed by extending the arms out to the sides and bringing them together in a hugging motion."
          }
        ]
      },
      {
        "week_id": "4",
        "week_name": "Week 4",
        "week_description": "This is week 4",
        "exercises": [
          {
            "exercise_name": "Dumbbell Bench Press",
            "exercise_description": "A compound exercise targeting the chest, shoulders, and triceps using dumbbells for added stability and range of motion."
          },
          {
            "exercise_name": "Chest Press",
            "exercise_description": "A fundamental exercise that targets the chest muscles, helping to build strength and muscle mass in the pectoral region."
          },
          {
            "exercise_name": "Chest Fly",
            "exercise_description": "An isolation exercise targeting the chest muscles, performed by extending the arms out to the sides and bringing them together in a hugging motion."
          }
        ]
      }
    ],
    "workout_image": "https://images.unsplash.com/photo-1434608519344-49d77a699e1d?q=80&w=2948&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "created_at": "2021-01-01T00:00:00.000Z",
    "updated_at": "2021-01-01T00:00:00.000Z"
  },
  {
    "workout_id": "2",
    "workout_name": "LEAN AND ACTIVE",
    "workout_description": "This is a full-body workout",
    "workout_level": "Intermediate",
    "workout_weeks": [
      {
        "week_id": "1",
        "week_name": "Week 1",
        "week_description": "This is week 1",
        "exercises": [
          {
            "exercise_name": "Squats",
            "exercise_description": "A fundamental lower body exercise that targets the quadriceps, hamstrings, and glutes. It involves bending the knees and lowering the hips as if sitting back into a chair, then returning to a standing position."
          },
          {
            "exercise_name": "Pushups",
            "exercise_description": "A classic upper body exercise that strengthens the chest, shoulders, and triceps. It is performed by lowering and raising the body using the arms while maintaining a straight line from head to heels."
          },
          {
            "exercise_name": "Plank",
            "exercise_description": "An isometric core exercise that involves maintaining a position similar to a pushup for the maximum possible time, engaging the abdominal muscles, back, and shoulders."
          }
        ]
      },
      {
        "week_id": "2",
        "week_name": "Week 2",
        "week_description": "This is week 2",
        "exercises": [
          {
            "exercise_name": "Deadlifts",
            "exercise_description": "A compound exercise that targets multiple muscle groups, including the lower back, glutes, hamstrings, and core. It involves lifting a loaded barbell from the ground to a standing position."
          },
          {
            "exercise_name": "Pullups",
            "exercise_description": "An upper body exercise that primarily targets the latissimus dorsi muscles in the back, as well as the biceps and shoulders. It is performed by pulling the body up to a bar until the chin is above the bar."
          },
          {
            "exercise_name": "Russian Twists",
            "exercise_description": "A core exercise that targets the oblique muscles. It is performed by sitting on the floor with knees bent, leaning back slightly, and twisting the torso from side to side while holding a weight or medicine ball."
          }
        ]
      },
      {
        "week_id": "3",
        "week_name": "Week 3",
        "week_description": "This is week 3",
        "exercises": [
          {
            "exercise_name": "Burpees",
            "exercise_description": "A full-body exercise that combines a squat, push-up, and jump to improve cardiovascular fitness, strength, and endurance."
          },
          {
            "exercise_name": "Overhead Press",
            "exercise_description": "A compound exercise that targets the shoulders, triceps, and upper chest by pressing a barbell or dumbbells overhead from shoulder height."
          },
          {
            "exercise_name": "Leg Raises",
            "exercise_description": "An effective core exercise that targets the lower abdominal muscles by lifting the legs while lying flat on the back."
          }
        ]
      },
      {
        "week_id": "4",
        "week_name": "Week 4",
        "week_description": "This is week 4",
        "exercises": [
          {
            "exercise_name": "Lunges",
            "exercise_description": "A lower body exercise that targets the quadriceps, hamstrings, and glutes. It involves stepping forward with one leg and lowering the hips until both knees are bent at a 90-degree angle."
          },
          {
            "exercise_name": "Mountain Climbers",
            "exercise_description": "A full-body exercise that combines cardio and strength training. It involves alternating knee drives towards the chest from a plank position, engaging the core, shoulders, and legs."
          },
          {
            "exercise_name": "Side Plank",
            "exercise_description": "An isometric core exercise that targets the obliques and improves stability. It involves balancing on one forearm and the side of one foot while keeping the body in a straight line."
          }
        ]
      }
    ],
    "workout_image": "https://images.unsplash.com/photo-1598971457999-ca4ef48a9a71?q=80&w=2940&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "created_at": "2021-02-01T00:00:00.000Z",
    "updated_at": "2021-02-01T00:00:00.000Z"
  },
  {
    "workout_id": "3",
    "workout_name": "POWER AND PERFORMANCE",
    "workout_description": "This is a strength-focused workout",
    "workout_level": "Advanced",
    "workout_weeks": [
      {
        "week_id": "1",
        "week_name": "Week 1",
        "week_description": "This is week 1",
        "exercises": [
          {
            "exercise_name": "Barbell Squats",
            "exercise_description": "A fundamental lower body exercise that targets the quadriceps, hamstrings, and glutes. It involves lifting a barbell while performing a squat, enhancing overall leg strength and stability."
          },
          {
            "exercise_name": "Bench Press",
            "exercise_description": "A compound upper body exercise that primarily targets the chest muscles, while also engaging the shoulders and triceps. It is performed by pressing a barbell away from the chest while lying on a bench."
          },
          {
            "exercise_name": "Pullups",
            "exercise_description": "An upper body exercise that primarily targets the latissimus dorsi muscles in the back, as well as the biceps and shoulders. It is performed by pulling the body up to a bar until the chin is above the bar."
          }
        ]
      },
      {
        "week_id": "2",
        "week_name": "Week 2",
        "week_description": "This is week 2",
        "exercises": [
          {
            "exercise_name": "Deadlifts",
            "exercise_description": "A compound exercise that targets the entire posterior chain, including the lower back, glutes, hamstrings, and core. It involves lifting a loaded barbell from the ground to a standing position."
          },
          {
            "exercise_name": "Military Press",
            "exercise_description": "A shoulder exercise that involves pressing a barbell or dumbbells overhead from shoulder height, targeting the deltoids, triceps, and upper chest."
          },
          {
            "exercise_name": "Chin-ups",
            "exercise_description": "An upper body exercise that primarily targets the biceps and upper back muscles. It is performed by pulling the body up to a bar with an underhand grip until the chin is above the bar."
          }
        ]
      },
      {
        "week_id": "3",
        "week_name": "Week 3",
        "week_description": "This is week 3",
        "exercises": [
          {
            "exercise_name": "Front Squats",
            "exercise_description": "A lower body exercise that targets the quadriceps, glutes, and core. It involves holding a barbell across the front of the shoulders and performing a squat, promoting strength and stability."
          },
          {
            "exercise_name": "Incline Bench Press",
            "exercise_description": "A variation of the bench press performed on an incline bench, targeting the upper chest and shoulders. It helps in building upper body strength and muscle definition."
          },
          {
            "exercise_name": "Barbell Rows",
            "exercise_description": "A compound exercise that targets the back muscles, including the latissimus dorsi, rhomboids, and trapezius. It involves pulling a barbell towards the torso while bent over, enhancing back strength and posture."
          }
        ]
      },
      {
        "week_id": "4",
        "week_name": "Week 4",
        "week_description": "This is week 4",
        "exercises": [
          {
            "exercise_name": "Sumo Deadlifts",
            "exercise_description": "A variation of the traditional deadlift that targets the inner thighs, glutes, and lower back. It involves a wider stance and gripping the barbell with hands placed inside the knees."
          },
          {
            "exercise_name": "Push Press",
            "exercise_description": "A compound exercise that combines a shoulder press with a slight leg drive, targeting the shoulders, triceps, and upper chest. It involves pressing a barbell overhead from shoulder height using momentum from the legs."
          },
          {
            "exercise_name": "Farmer’s Walk",
            "exercise_description": "A functional strength exercise that targets the grip, forearms, shoulders, and core. It involves walking a set distance while carrying heavy weights in each hand, simulating the action of carrying heavy loads."
          }
        ]
      }
    ],
    "workout_image": "https://images.unsplash.com/photo-1517836357463-d25dfeac3438?q=80&w=2940&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "created_at": "2021-03-01T00:00:00.000Z",
    "updated_at": "2021-03-01T00:00:00.000Z"
  },
  {
    "workout_id": "4",
    "workout_name": "ENDURANCE BOOST",
    "workout_description": "This is a cardio and endurance workout",
    "workout_level": "Beginner",
    "workout_weeks": [
      {
        "week_id": "1",
        "week_name": "Week 1",
        "week_description": "This is week 1",
        "exercises": [
          {
            "exercise_name": "Jogging",
            "exercise_description": "A cardiovascular exercise that involves running at a steady, moderate pace to improve endurance and cardiovascular health."
          },
          {
            "exercise_name": "Jump Rope",
            "exercise_description": "A high-intensity cardiovascular exercise that involves jumping over a swinging rope, enhancing coordination, agility, and cardiovascular fitness."
          },
          {
            "exercise_name": "High Knees",
            "exercise_description": "A dynamic exercise that involves running in place while lifting the knees as high as possible, targeting the core, hip flexors, and cardiovascular system."
          }
        ]
      },
      {
        "week_id": "2",
        "week_name": "Week 2",
        "week_description": "This is week 2",
        "exercises": [
          {
            "exercise_name": "Cycling",
            "exercise_description": "A low-impact cardiovascular exercise that involves pedaling a stationary or outdoor bicycle, improving leg strength, endurance, and overall cardiovascular health."
          },
          {
            "exercise_name": "Burpees",
            "exercise_description": "A full-body exercise that combines a squat, push-up, and jump to enhance cardiovascular fitness, strength, and endurance."
          },
          {
            "exercise_name": "Mountain Climbers",
            "exercise_description": "A high-intensity exercise that involves alternating knee drives towards the chest from a plank position, engaging the core, shoulders, and legs for a full-body workout."
          }
        ]
      },
      {
        "week_id": "3",
        "week_name": "Week 3",
        "week_description": "This is week 3",
        "exercises": [
          {
            "exercise_name": "Running",
            "exercise_description": "A cardiovascular exercise that involves running at a steady pace to improve endurance, cardiovascular health, and overall fitness."
          },
          {
            "exercise_name": "Squat Jumps",
            "exercise_description": "A plyometric exercise that combines a squat with a jump to enhance lower body strength, power, and cardiovascular fitness."
          },
          {
            "exercise_name": "Plank Jacks",
            "exercise_description": "A dynamic core exercise that combines a plank position with jumping the feet in and out, targeting the core, shoulders, and cardiovascular system."
          }
        ]
      },
      {
        "week_id": "4",
        "week_name": "Week 4",
        "week_description": "This is week 4",
        "exercises": [
          {
            "exercise_name": "Rowing",
            "exercise_description": "A full-body cardiovascular exercise that simulates the action of rowing a boat, engaging the legs, core, and upper body to improve endurance and strength."
          },
          {
            "exercise_name": "Jumping Lunges",
            "exercise_description": "A plyometric exercise that combines lunges with a jump to enhance lower body strength, power, and cardiovascular fitness. It involves alternating legs in a lunge position while jumping explosively."
          },
          {
            "exercise_name": "Spiderman Planks",
            "exercise_description": "A dynamic core exercise that involves bringing the knee towards the elbow while maintaining a plank position, targeting the obliques, shoulders, and overall core stability."
          }
        ]
      }
    ],
    "workout_image": "https://images.unsplash.com/photo-1591258370814-01609b341790?q=80&w=2787&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "created_at": "2021-04-01T00:00:00.000Z",
    "updated_at": "2021-04-01T00:00:00.000Z"
  }
]
